Repository: Wykowjbu/portfolio-wykowjbu
Catalog: Resources/Views/Home/Index.*.resx
Languages: ja_jp, vi_vn

# Hero.Greeting
source: Hi, I'm Phan Huy
ja_jp: こんにちは、ファン・フイです
vi_vn: Xin chào, tôi là Phan Huy

# Hero.Title
source: .NET Developer Intern | Software Engineering Student
ja_jp: .NETデベロッパーインターン | ソフトウェア工学専攻
vi_vn: Lập trình viên .NET Intern | Sinh viên Công nghệ phần mềm

# Hero.Description
source: Passionate about building robust web applications with ASP.NET Core. Currently pursuing Software Engineering at FPT University with a focus on .NET technologies.
ja_jp: ASP.NET Coreで堅牢なWebアプリケーションを構築することに情熱を持っています。現在、FPT大学でソフトウェア工学を専攻し、.NET技術に焦点を当てています。
vi_vn: Đam mê xây dựng ứng dụng web mạnh mẽ với ASP.NET Core. Hiện đang theo học ngành Công nghệ phần mềm tại Đại học FPT với chuyên môn về công nghệ .NET.

# About.Title
source: About Me
ja_jp: 自己紹介
vi_vn: Về tôi

# About.Intro
source: I am a Software Engineering student at FPT University, specializing in .NET development. With hands-on experience in testing large-scale migration projects and developing full-stack applications, I am eager to contribute to innovative software solutions.
ja_jp: FPT大学のソフトウェア工学専攻の学生で、.NET開発を専門としています。大規模な移行プロジェクトのテストやフルスタックアプリケーションの開発の実務経験があり、革新的なソフトウェアソリューションに貢献したいと考えています。
vi_vn: Tôi là sinh viên ngành Công nghệ phần mềm tại Đại học FPT, chuyên về phát triển .NET. Với kinh nghiệm thực tế trong kiểm thử dự án di chuyển quy mô lớn và phát triển ứng dụng full-stack, tôi mong muốn đóng góp vào các giải pháp phần mềm sáng tạo.

# About.Education
source: Education
ja_jp: 学歴
vi_vn: Học vấn

# About.EducationDetails
source: FPT University (2022 - Present) - Software Engineering Major (.NET-oriented) - Expected Graduation: Late 2026
ja_jp: FPT大学（2022年 - 現在）- ソフトウェア工学専攻（.NET方向）- 卒業予定：2026年末
vi_vn: Đại học FPT (2022 - Hiện tại) - Ngành Công nghệ phần mềm (định hướng .NET) - Dự kiến tốt nghiệp: Cuối năm 2026

# Highlights.Title
source: What I Do
ja_jp: できること
vi_vn: Điểm mạnh

# Highlights.WebDev
source: Web Development
ja_jp: Web開発
vi_vn: Phát triển Web

# Highlights.WebDevDesc
source: Building web applications using ASP.NET Core MVC and Web API with clean architecture
ja_jp: ASP.NET Core MVCとWeb APIを使用したクリーンアーキテクチャのWebアプリケーション開発
vi_vn: Xây dựng ứng dụng web sử dụng ASP.NET Core MVC và Web API với kiến trúc sạch

# Highlights.Testing
source: Software Testing
ja_jp: ソフトウェアテスト
vi_vn: Kiểm thử phần mềm

# Highlights.TestingDesc
source: Experienced in manual testing, regression testing, and quality assurance in large-scale projects
ja_jp: 大規模プロジェクトでの手動テスト、リグレッションテスト、品質保証の経験があります
vi_vn: Có kinh nghiệm về kiểm thử thủ công, kiểm thử hồi quy và đảm bảo chất lượng trong các dự án quy mô lớn

# Highlights.Database
source: Database Management
ja_jp: データベース管理
vi_vn: Quản lý cơ sở dữ liệu

# Highlights.DatabaseDesc
source: Working with SQL Server and PostgreSQL for data modeling and query optimization
ja_jp: SQL ServerとPostgreSQLを使用したデータモデリングとクエリ最適化
vi_vn: Làm việc với SQL Server và PostgreSQL cho việc mô hình hóa dữ liệu và tối ưu truy vấn

# CTA.ViewProjects
source: View My Projects
ja_jp: プロジェクトを見る
vi_vn: Xem dự án của tôi

# CTA.GetInTouch
source: Get In Touch
ja_jp: お問い合わせ
vi_vn: Liên hệ với tôi

# CTA.Interested
source: Interested in working together?
ja_jp: 一緒に仕事をすることに興味がありますか？
vi_vn: Quan tâm đến việc hợp tác cùng nhau?
